cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/fuse'
tap 'homebrew/services'
tap 'neovim/neovim'

# basic needs
brew 'git'
brew 'go'
brew 'homebrew/fuse/ntfs-3g'
brew 'hub'
brew 'neovim/neovim/neovim'
brew 'node'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'python'
brew 'rbenv'
brew 'tmux'
brew 'wget'
brew 'zsh'
brew 'reattach-to-user-namespace'

# local services
brew 'memcached', restart_service: true
brew 'postgresql'
brew 'redis', restart_service: true
brew 'sqlite'

# grpc and protobuf
brew 'protobuf'

# assorted libraries
brew 'ansifilter'
brew 'aspell', args: ['with-all-langs']
brew 'autoconf'
brew 'automake'
brew 'boost'
brew 'cairo'
brew 'cgal'
brew 'cmake'
brew 'cscope'
brew 'ctags'
brew 'ffmpeg'
brew 'fontconfig'
brew 'freetype'
brew 'freexl'
brew 'fzf'
brew 'gdal'
brew 'gdbm'
brew 'geos'
brew 'gettext'
brew 'giflib'
brew 'glib'
brew 'gmp'
brew 'gobject-introspection'
brew 'harfbuzz'
brew 'icu4c'
brew 'jpeg'
brew 'json-c'
brew 'lame'
brew 'libevent'
brew 'libffi'
brew 'libgeotiff'
brew 'liblwgeom'
brew 'libpng'
brew 'libspatialite'
brew 'libtiff'
brew 'libtool'
brew 'libxml2'
brew 'libyaml'
brew 'little-cms2'
brew 'lzlib'
brew 'mpfr'
brew 'openssl'
brew 'optipng'
brew 'pango'
brew 'pcre'
brew 'pcre2'
brew 'pixman'
brew 'pkg-config'
brew 'postgis'
brew 'proj'
brew 'qt'
brew 'readline'
brew 'rg'
brew 'ruby-build'
brew 'sfcgal'
brew 'sip'
brew 'smartmontools'
brew 'utf8proc'
brew 'webp'
brew 'wxmac'
brew 'x264'
brew 'xvid'
brew 'xz'
brew 'zeromq'

# k8s
brew 'kubernetes-cli'
cask 'minikube'
brew 'kubectx'

# utilities
brew 'pandoc'
brew 'the_silver_searcher'
brew 'watchman'
brew 'yarn'
brew 'youtube-dl'

# other languages of curiosity
brew 'elixir'
brew 'erlang'
brew 'haskell-stack'
brew 'leiningen'

# casks
cask '1password'
cask 'appcleaner'
cask 'bettertouchtool'
cask 'docker-toolbox'
cask 'emacs'
cask 'firefox'
cask 'flux'
cask 'franz'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'karabiner-elements'
cask 'nvalt'
cask 'osxfuse'
cask 'postgres'
cask 'postman'
cask 'sourcetree'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'transmission'
cask 'tunnelblick'
cask 'vagrant'
cask 'virtualbox'
