cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'neovim/neovim'

# basic needs
brew 'git'
brew 'go'
cask 'osxfuse'
brew 'ntfs-3g'
brew 'hub'
brew 'neovim'
brew 'node'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'python'
brew 'rbenv'
brew 'tmux'
brew 'wget'
brew 'zsh'
brew 'reattach-to-user-namespace'

# local services
brew 'memcached', restart_service: true
brew 'postgresql'
brew 'redis', restart_service: true
brew 'sqlite'

# grpc and protobuf
brew 'protobuf'

# k8s
brew 'kubernetes-cli'
cask 'minikube'
brew 'kubectx'

# utilities
brew 'pandoc'
brew 'the_silver_searcher'
brew 'watchman'
brew 'yarn'
brew 'youtube-dl'

# other languages of curiosity
brew 'elixir'
brew 'erlang'
brew 'haskell-stack'
brew 'leiningen'

# casks
cask '1password'
cask 'appcleaner'
cask 'bettertouchtool'
cask 'docker-toolbox'
cask 'emacs'
cask 'firefox'
cask 'franz'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'karabiner-elements'
cask 'nvalt'
cask 'postgres'
cask 'postman'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'transmission'
cask 'tunnelblick'
cask 'vagrant'
cask 'virtualbox'
