cask_args appdir: '/Applications'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'neovim/neovim'
tap 'domt4/autoupdate'

# basic needs
brew 'direnv'
brew 'git'
brew 'go'
brew 'hub'
brew 'neovim'
brew 'node'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'python'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'tmux'
brew 'wget'
brew 'zsh'
cask 'osxfuse'

# local services
brew 'postgresql'
brew 'redis'
brew 'sqlite'

# grpc and protobuf
brew 'protobuf'

# k8s
brew 'kubernetes-cli'
brew 'kubectx'

# utilities
brew 'pandoc'
brew 'the_silver_searcher'
brew 'ripgrep'
brew 'watchman'
brew 'yarn'
brew 'youtube-dl'

# casks
cask '1password'
cask 'anki'
cask 'appcleaner'
cask 'backblaze'
cask 'bettertouchtool'
cask 'docker'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'karabiner-elements'
cask 'omnifocus'
cask 'postgres'
cask 'postman'
cask 'ripcord'
cask 'simplenote'
cask 'slack'
cask 'soulver'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'telegram'
cask 'the-unarchiver'
cask 'transmission'
cask 'tunnelblick'
cask 'zoomus'
