cask_args appdir: '/Applications'
tap 'homebrew/cask-fonts'

# basic needs
brew 'direnv'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'go'
brew 'hub'
brew 'n'
brew 'postgresql'
brew 'ripgrep'
brew 'wget'
brew 'zsh'

# casks
cask '1password'
cask 'anki'
cask 'appcleaner'
cask 'bettertouchtool'
cask 'docker'
cask 'google-chrome'
cask 'iterm2'
cask 'karabiner-elements'
cask 'postico'
cask 'postman'
cask 'spectacle'
cask 'spotify'
cask 'telegram'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'obsidian'
