cask_args appdir: '/Applications'
tap 'homebrew/cask-versions'
tap 'd12frosted/emacs-plus'
tap 'homebrew/cask-fonts'

# basic needs
brew 'cmake'
brew 'direnv'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'go'
brew 'hub'
brew 'n'
brew 'pandoc'
brew 'postgresql'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'python'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'stow'
brew 'tree'
brew 'wget'
brew 'youtube-dl'
brew 'zsh'

# casks
cask '1password'
cask 'anki'
cask 'appcleaner'
cask 'bettertouchtool'
cask 'docker'
cask 'firefox-developer-edition'
cask 'font-fira-code'
cask 'google-chrome'
cask 'iterm2'
cask 'karabiner-elements'
cask 'postico'
cask 'postman'
cask 'spectacle'
cask 'spotify'
cask 'telegram'
cask 'the-unarchiver'
cask 'transmission'
cask 'visual-studio-code'
