;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

(package! evil-escape)
(package! git-link)
(package! forge)

;;; language-specific
(package! dockerfile-mode)
(package! json-mode)
(package! protobuf-mode)

;;; golang
(package! go-mode)

;;; python
(package! elpy)
(package! py-autopep8)
(package! pyimpsort)

;;; javascript
(package! js2-mode)
(package! rjsx-mode)
(package! prettier-js)
(package! add-node-modules-path)
(package! eslintd-fix)
