;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

(package! exec-path-from-shell)
(package! forge)
(package! git-link)

;;; language/syntax-specific packages
(package! json-mode)
(package! protobuf-mode)

;; :lang/go
(package! go-playground)

;; :lang/javascript
(package! prettier-js)

;; :lang/python
(package! lsp-python-ms)
